In [1]:
import numpy as np
import pandas as pd

ModuleNotFoundError: No module named 'pandas'

In [ ]:
a=[4,6,5,8,3]
x=pd.Series(a,index=['a','b','c','d','e'])
print(x.index)
print(x.values)
print(x.dtype)
print(x)

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')
[4 6 5 8 3]
int64
a    4
b    6
c    5
d    8
e    3
dtype: int64

In [ ]:
b={'홍길동':70,'김길동':60,'빅길동':84,'이길동':77}
s1=pd.Series(b)
print(s1.index)
print(s1.values)
s1.index=['hong','kim','big','lee']
print(s1)

Index(['홍길동', '김길동', '빅길동', '이길동'], dtype='object')
[70 60 84 77]
hong    70
kim     60
big     84
lee     77
dtype: int64

In [ ]:
print(s1['kim'])
print(s1[['kim','hong']])
print(s1['hong':'big'])

60
kim     60
hong    70
dtype: int64
hong    70
kim     60
big     84
dtype: int64

In [ ]:
s1=pd.Series([10,20,30,40,50])
s2=pd.Series([100,200,300,400,500])
s3=s1+s2
print(s3+1000)

0    1110
1    1220
2    1330
3    1440
4    1550
dtype: int64

In [ ]:
names=['민준','현우','서연','동현','지현']
years=[2013,2014,2013,2015,2016]
points=[1.5,1.7,3.6,2.4,2.9]
data={'names':names,'years':years,'points':points}
df=pd.DataFrame(data)
df

  names  years  points
0    민준   2013     1.5
1    현우   2014     1.7
2    서연   2013     3.6
3    동현   2015     2.4
4    지현   2016     2.9

In [ ]:
data=[names,years,points]
df=pd.DataFrame(data)
df

      0     1     2     3     4
0    민준    현우    서연    동현    지현
1  2013  2014  2013  2015  2016
2   1.5   1.7   3.6   2.4   2.9

In [ ]:
df2=pd.DataFrame(data).transpose()
df2.columns=['names','years','points']
df2

  names years points
0    민준  2013    1.5
1    현우  2014    1.7
2    서연  2013    3.6
3    동현  2015    2.4
4    지현  2016    2.9

In [ ]:
data1=zip(data[0],data[1],data[2])
df1=pd.DataFrame(data1,columns=['names','years','points'],index=['one','two','three','four','five'])
df1

      names  years  points
one      민준   2013     1.5
two      현우   2014     1.7
three    서연   2013     3.6
four     동현   2015     2.4
five     지현   2016     2.9

In [ ]:
data3=zip(data[0],data[1],data[2])
df3=pd.DataFrame(data3,columns=['names','years','points'],index=['one','two','three','four','five'])
df3.columns.name='coulmn_name'
df3.index.name='index_name'
df3

coulmn_name names  years  points
index_name
one            민준   2013     1.5
two            현우   2014     1.7
three          서연   2013     3.6
four           동현   2015     2.4
five           지현   2016     2.9

In [ ]:
df3.describe()

coulmn_name       years    points
count           5.00000  5.000000
mean         2014.20000  2.420000
std             1.30384  0.864292
min          2013.00000  1.500000
25%          2013.00000  1.700000
50%          2014.00000  2.400000
75%          2015.00000  2.900000
max          2016.00000  3.600000

In [ ]:
print(df1['names'])
print(df1.names)
print(df1.points)

one      민준
two      현우
three    서연
four     동현
five     지현
Name: names, dtype: object
one      민준
two      현우
three    서연
four     동현
five     지현
Name: names, dtype: object
one      1.5
two      1.7
three    3.6
four     2.4
five     2.9
Name: points, dtype: float64

In [ ]:
df1['penalty']=[0.5,0.1,0.3,0.2,0.4]
df1['abc']=np.arange(5)
print(df1)
del df1['abc']
print(df1)

      names  years  points  penalty  abc
one      민준   2013     1.5      0.5    0
two      현우   2014     1.7      0.1    1
three    서연   2013     3.6      0.3    2
four     동현   2015     2.4      0.2    3
five     지현   2016     2.9      0.4    4
      names  years  points  penalty
one      민준   2013     1.5      0.5
two      현우   2014     1.7      0.1
three    서연   2013     3.6      0.3
four     동현   2015     2.4      0.2
five     지현   2016     2.9      0.4

In [ ]:
print(df1['one':'three'])
print(df1.loc['one'])
print(df1.loc['one','names'])

      names  years  points  penalty
one      민준   2013     1.5      0.5
two      현우   2014     1.7      0.1
three    서연   2013     3.6      0.3
names        민준
years      2013
points      1.5
penalty     0.5
Name: one, dtype: object
민준

In [ ]:
df1.iloc[1:3,1:3]

        years  points
two    2014.0     1.7
three  2013.0     3.6

In [ ]:
df1.loc['six',:]=['길동',2017,0.3,2.0]
df1

      names   years  points  penalty
one      민준  2013.0     1.5      0.5
two      현우  2014.0     1.7      0.1
three    서연  2013.0     3.6      0.3
four     동현  2015.0     2.4      0.2
five     지현  2016.0     2.9      0.4
six      길동  2017.0     0.3      2.0

In [ ]:
print(df1.loc[df1['years']>2014,:]) #years가 2014보다 큰 위치를 출력
print(df1.loc[df1.years>2014,:])
print(df1.loc[df1.names=='길동',:])
print(df1.loc[(df1.points>2)&(df1.points<3),:])
df1.loc[df1.points>3,'penalty']=0
df1

     names   years  points  penalty
four    동현  2015.0     2.4      0.2
five    지현  2016.0     2.9      0.4
six     길동  2017.0     0.3      2.0
     names   years  points  penalty
four    동현  2015.0     2.4      0.2
five    지현  2016.0     2.9      0.4
six     길동  2017.0     0.3      2.0
    names   years  points  penalty
six    길동  2017.0     0.3      2.0
     names   years  points  penalty
four    동현  2015.0     2.4      0.2
five    지현  2016.0     2.9      0.4

      names   years  points  penalty
one      민준  2013.0     1.5      0.5
two      현우  2014.0     1.7      0.1
three    서연  2013.0     3.6      0.0
four     동현  2015.0     2.4      0.2
five     지현  2016.0     2.9      0.4
six      길동  2017.0     0.3      2.0

In [ ]:
df3=pd.DataFrame(np.random.rand(6,4))
df3.columns=['A','B','C','D']
df3.index=pd.date_range('20220501',periods=6)
df3['F']=[1.0,np.nan,3.5,6.1,np.nan,7.0]
df3

                   A         B         C         D    F
2022-05-01  0.616858  0.652445  0.576186  0.794353  1.0
2022-05-02  0.179302  0.368046  0.288137  0.511744  NaN
2022-05-03  0.567613  0.993322  0.286687  0.276293  3.5
2022-05-04  0.949237  0.192268  0.564836  0.521084  6.1
2022-05-05  0.763316  0.772832  0.421177  0.890413  NaN
2022-05-06  0.187556  0.592474  0.871910  0.899445  7.0

In [ ]:
df4=df3.dropna(how='any')
df4

                   A         B         C         D    F
2022-05-01  0.616858  0.652445  0.576186  0.794353  1.0
2022-05-03  0.567613  0.993322  0.286687  0.276293  3.5
2022-05-04  0.949237  0.192268  0.564836  0.521084  6.1
2022-05-06  0.187556  0.592474  0.871910  0.899445  7.0

In [ ]:
df3.isnull() #값이 NaN이면 True
df3.loc[df3.isnull()['F'],:] #F열에 NaN값이 있는 행을 출력

                   A         B         C         D   F
2022-05-02  0.179302  0.368046  0.288137  0.511744 NaN
2022-05-05  0.763316  0.772832  0.421177  0.890413 NaN

In [ ]:
pd.to_datetime('20220101082233')

Timestamp('2022-01-01 08:22:33')

In [ ]:
df4=df3.drop([pd.to_datetime('20220503'),pd.to_datetime('20220501')])
df4

                   A         B         C         D    F
2022-05-02  0.179302  0.368046  0.288137  0.511744  NaN
2022-05-04  0.949237  0.192268  0.564836  0.521084  6.1
2022-05-05  0.763316  0.772832  0.421177  0.890413  NaN
2022-05-06  0.187556  0.592474  0.871910  0.899445  7.0

In [ ]:
df4=df3.drop(['D','F'],axis=1)
df4

                   A         B         C
2022-05-01  0.616858  0.652445  0.576186
2022-05-02  0.179302  0.368046  0.288137
2022-05-03  0.567613  0.993322  0.286687
2022-05-04  0.949237  0.192268  0.564836
2022-05-05  0.763316  0.772832  0.421177
2022-05-06  0.187556  0.592474  0.871910